{"1610750487992889344": "@lebfirecracker The apples to oranges comparisons, the egregious reading comprehension. I swear a hell of people missed their English classes fr", "1610734245416415233": "@lebfirecracker Absolutely great thread. We still haven’t replaced hazard and more importantly , the Matic- Fabregas duo. The midfield is the most important position for any team. We have neglected that for so long. Time to invest big time in there and revamp the midfield", "1610733641549910016": "@CHlLWELLS What happened ?", "1610730029595652096": "Did you notice whilst there has been so much noise about the Enzo deals from others that we didn’t we get the Orny dagger ? @TOSOTC_CFC", "1610709176766058496": "Enzo was the only thing that was exciting about cfc in the recent days. I couldn’t give a squat about anything else. We’re gonna get plundered by Citeh. Absolute tools.", "1610699903583547393": "@CHlLWELLS HaHAHaHaahahahaa", "1610698869985402886": "@cfccally Exactly. I usually like the guy for good takes but I don’t agree with him on this.", "1610503574517317632": "@Mammothoffl2 @PrasannaBalakr2 Comes from a person who has an Argentina flag eons after the World Cup whilst being in a different country. Talk about casuals lol", "1610503212263669760": "@PrasannaBalakr2 Btw where were you when a grown arse man like him called players with names like “Mickey Mount” lol. Have the same energy or pipe down fella", "1610502658263224320": "@PrasannaBalakr2 Idgaf. I can’t stand to be quiet when someone spouts garbage on a daily basis to gain clout. At that point, it ain’t just for giving opinions but to be edgy and generate clout.", "1610502248458747905": "@Kriba1616 Lol username checks. Pipe down and stick to your basement tool", "1610491199630245891": "Amazing thread", "1610485172528648192": "@jestersvengence We both are fighting a losing battle in this debate lol. Croatia ain’t won squat either", "1610479563808854018": "@jestersvengence I disagree. England are worse than Croatia , that’s for sure. Croatia are the actual bottlers lol. Bottling in the semis and finals", "1610478357434753026": "@jestersvengence By the same people who said Gvardiol was the best CB this World Cup", "1610472167837433856": "@jestersvengence Maguire was considered as one of the best CBs at the 2018 World Cup. Nuff said", "1610469267178418177": "@mevvybear What’s the crust made of ?", "1610463465730342912": "@jestersvengence I mean didn’t you lot gass up a guy doing well in Bundesliga and got absolutely put down by the 🐐 lol. Go on", "1610461128785801217": "@jestersvengence", "1610453432095363072": "@CHlLWELLS Great minds think alike", "1610452728509267972": "Oh yeah. He ain’t coming", "1610448796194074625": "@Zvoii_ Lol I ain’t gonna watch nothin. It’s easy these days to just say “mY oPinIoN” and come up with absolute gobshit of a take.", "1610447779570253824": "@Zvoii_ Big talk coming from someone who lacks a lot of things when it comes to speaking about Chelsea lol. Pipe down fella", "1610435848742531072": "Where’s my Argentine boy at https://t.co/FiRcvf9Sa0", "1610415756642254852": "@bellacfc *in", "1610415724811685888": "@bellacfc Nah. He’s still bad on organising a defense", "1610415298401939459": "@TOSOTC_CFC @matissearmani", "1610381108558061569": "Wow, I’m really disappointed in Lamps. Has been really bad. Had to wonder whether management is right for him. He has to go abroad and fend for himself .", "1610362960064708608": "Any donkey these days can buy a headphone, camera and have an opinion. Internet is truly a double-edged sword. Gotta think about whether ubiquitisation of  resources are worth it in the first place", "1610333322739331072": "@cfcwevans It defo won’t happen", "1610160050231988225": "@TrollFootballtv Thank god", "1610147500148805634": "@feroze17 Oh siiiii", "1610110096394301441": "@TrollFootballtv RIP 💔", "1610080557656076290": "@mountcIear His loss haha", "1610069096586186753": "😭😭😭. You ain’t that guy pal. Flexing like medals lol. Shameless . But I respect the hustle", "1609844996911534080": "The culture of blindly backing someone just cause he’s a manager is stupidity. It’s ok to have reservations. At the same time, squealing “pOttER oUt” , is also dumb. There’s no middle ground in this fan base", "1609843344687140866": "Ngl the Enzo links made me excited to be a cfc fan alone. Apart from that, I have completely lost all excitement for a game. Thank god the women are doing bits. Else it would be even worse.", "1609751216824909826": "@jestersvengence What did he do lol", "1609749263365582853": "@jestersvengence Wow. You really are rattled by Colwill lol", "1609642679390064640": "@cfccally Chill Cally. Happy new year", "1609617350269243392": "@CHlLWELLS 😭", "1609616225738567683": "The players are really bad. Can’t blame potter for the goal but he had 30 mins to make some changes and turn the game. Should be doing better", "1609495570695213056": "Badiashile in the bag. That’s a good one. Now we NEED to get the big one ASAP", "1609233010905477120": "@DasZehnerRole 😭. Loooool. Shows you didn’t read my tweet properly", "1608955244427481089": "This guy😭😭😭. Gotta respect the hustle https://t.co/pUoQU4A6RJ", "1608947272288710656": "@jestersvengence We haven’t bid for leao either , so? Does it mean why don’t want him?", "1608946883921313792": "Ofc the societal impact and the underlying importance is incomparable (cause ofc that’s racism allegations). But it’s the lame way of saying I ain’t something cause so and so…", "1608946611312545792": "*checks notes* English, add to the XI. this donkey saying “I DiDnT aDd ReEce JaMeS or JoE cOle”, is the equivalent of I’m not racist cause I have a black dog", "1608886767788388352": "@matissearmani What happened? We ain’t getting Enzo guys. Chill down . It’s a pipe dream 😭", "1608750205327020035": "@TOSOTC_CFC @FabrizioRomano It’s 1 am here. I think we mighh get a here we go by the time I wake up", "1608745924012183553": "@FabrizioRomano @TOSOTC_CFC when’s the live stream 😭", "1608745651814412295": "@SonOfChelsea Enzo+ Rice. All I ask for . If given, we’re settled for a decade", "1608636601542004736": "@CHlLWELLS I’m opposite of gassed. I have accepted we ain’t getting him. Tell Orny gives a dagger, we ain’t even in for him. I fear this is just clout chasing by the media conveniently before the start of the transfer window", "1608636001085423618": "@CHlLWELLS He’s my dream sigining . If you search up Enzo in my profile , you can find a buck load of tweets 😭. That said I don’t think we’re ever getting him", "1608629008014667779": "@FutbolCheIsea Ok what happened ?", "1608628911273046016": "Why are everyone gassed that we’ll get Enzo. It ain’t gonna happen😔. I’ll have to watch another world class mid go to a rival team (like tchouameni).", "1608574187299565571": "@TOSOTC_CFC Totally agreed Miz. Remember we are yet to make an actual Statement signing under  this ownership. This guy could be that and poster boy for the project", "1608548702154813444": "@CarefreeLewisG the owners are astute. We would want a senior player in the midfield to guide the new ones. I would preferred J5 to be that guy tbh but given Kante( rightfully managed ) can go super Saiyaan for some important games and he’s a legend of the game, I think we’re sticking with him", "1608499815960436740": "@jestersvengence Loool ok", "1608352774810652675": "So that’s Enzo gone . Damn", "1608234161265078274": "@cfcwevans Rice and Enzo is the dream. The perfect midfield duo that brings the best out of both", "1608182368678084608": "First stage of grieving, Denial 😭", "1608149788977139713": "@cfcubamfueye @monstarcfc Illiteracy does not only imply reading but reading comprehension too", "1608064461646213121": "@monstarcfc Exactly lol. Just shows the state of illiteracy . Just look at how many twats believe it . Smh", "1608064164857253894": "@Just7ce @avengerxgaming @jabbawovk @CatenaccioEra You trounced that fool lol", "1608052895693557761": "@CFCExtra You’re correct. But I need some excitement 😭😭. Some I’m choosing to see what it is haha. But, that Pedro guy is super dodgy. I do feel Boehly would make a statement midfield signing. If we were to sign Enzo(which I’m desperate for) , we gotta do it this Jan", "1608003487023124480": "@siphillipssport How reliable is the source si? Don’t gass meeeee", "1607881999045529600": "@TOSOTC_CFC @matissearmani @YounesTalks boehly’s meals do be the best", "1607881685278019584": "@AshwathRamesh7", "1607881007969206272": "@jlb26_ What??? This is an incredible deal. This guy is gonna be the best mid of this decade", "1607880780558274560": "Boehlyyyyyyyyyy", "1607880611498438657": "@AshwathRamesh7 That’s what I thought . Don’t you have 3-4 CBs already? I think this is a trick from Monaco to up the asking price", "1607863028963508225": "Not these beggars again", "1607861809134067716": "Many fans in our fan base would have passed up on Casemiro cause he was old and “not a good passer”.. He’s one of the best DMs of the last decade", "1607840601709613056": "https://t.co/W27XIcRji1", "1607840358637133830": "Shut up for once. These donkeys gotta get a job and a life", "1607827743559028736": "@CHlLWELLS What happened ?", "1607798963318689792": "So where are all the Donkeys", "1607791275796987905": "@CHlLWELLS Me neither 😭", "1607513965663514624": "Wow", "1607496222889349120": "@TOSOTC_CFC My guy who said West Ham are on the same level as us", "1607431589482618881": "Stick to united  lad. Man didn’t see the killer recruitment team assembled by Boehly but waffles", "1607431208228786176": "@KlNGLEAR He’s actually a good young CB. Could be a Azpi-esque master stroke. We gotta a killer recruitment team now. I think they’re gonna unearth some gems", "1607430471713185792": "@KlNGLEAR People just wanna go by YouTube comps and suck up to them. Gonna be a rude awakening if he fails. But I hope he doesn’t", "1607247032611393537": "@KlNGLEAR Is this for chilly lol", "1607147011295547393": "@CHlLWELLS Ooo. Merry Xmas", "1607116638981353472": "@CHlLWELLS I have 2 cats haha", "1607105054888333313": "@CHlLWELLS Racle. A miracle 😭😭", "1607101512324612096": "@CHlLWELLS i", "1607100575757500417": "@CHlLWELLS … m", "1607097830841389056": "@CHlLWELLS ….", "1607097521192734720": "@CHlLWELLS Chilly is ….", "1607096047414935553": "@CHlLWELLS Oh yeah.", "1607064472518299648": "“My”. Who’s this donkey", "1606768969146597377": "@KlNGLEAR Damn. Seems like an absolute weirdo", "1606767548443549696": "@KlNGLEAR Did you try mass reporting him?", "1606765792204591105": "@KlNGLEAR I don’t know the backstory liaaaaaaa😭😭😭", "1606746948060721154": "@CHlLWELLS NO WAY", "1606721073961369600": "@CHlLWELLS They’re CR7 fanboys in disguise 😭😭😭", "1606718220073070592": "@CHlLWELLS Who’s comparing Haaland and mbappe with the 🐐", "1606713613238292480": "@CHlLWELLS Yeah yeah , he’s one of the best CBs Available. But we gotta prioritize areas", "1606707892555780098": "@McZurich255 @FutbolCheIsea You have a J5 avi. Talk about holding us back", "1606704233361084416": "@CHlLWELLS I think this is a gem signing. Gvardiol would have been the obvious. I have heard of Badashile before and he’s a very good young CB. Perhaps no Gvardiol ofc but we need to splurge on the midfield and attack. So we’re trusting the scouts to save money and get value for money", "1606703135522983937": "@CHlLWELLS *real madrid", "1606702873450262528": "@CHlLWELLS This was never the way . We must try to emulate arms ffs", "1606702593669206016": "@CHlLWELLS I can’t believe we’re trying to emulate assnal", "1606695101765660674": "Lol this guy’ obsession with ninii is way too funny . These hipsters 😭😭", "1606502308619378690": "@AshwathRamesh7 Speak into existence man", "1606464927618969600": "@KlNGLEAR Exactly! I can’t fathom how someone who came in free of cost and was instrumental in our CL win was being scapegoated a lot. “That” side of twitter has actually succeeded in reverting a lot of people’s opinions. It’s actually baffling", "1606464116935495680": "@KlNGLEAR There are times when I’m pissed at him but seeing those donkeys I revert back to defending him. It feels sucky but I can’t not help but defend him when he’s hounded out", "1606462591991443456": "@KlNGLEAR That’s totally true. I’ll criticise him but I can’t stand it when the low life tools get on his back. That’s the line for me", "1606429619871420416": "@KlNGLEAR 😭😭😭😭😭. Stay safe out there Lia.", "1606429555837009920": "@LumpOfCFC @CFCDaily Are the replica ones good?", "1606427041146241030": "@KlNGLEAR Oh you’ll be surprised haha", "1606410836054274050": "@AshwathRamesh7 Dei. Enzo is proven and has made the step up in Europe. We can’t guarantee Santos will do the same. The underlying progressive stats for Enzo is insane. I don’t think we can say the same for Santos", "1606406102979121152": "I’m concerned at the lack of links with Enzo. Ffs UTd and pool are super in for him. We must pay whatever it takes. He IS the real deal", "1605969917030776835": "@CHlLWELLS @jlb26_ Awww😭😭", "1605825841853865984": "@SonOfChelsea @CFCDaily @AlexGoldberg_ True to an extent but short term doesn’t mean signing 30+ yr olds and reckless signings. Rice and Enzo are an example. Players who are balling right now and young. We should be targeting them mainly", "1605487163658878976": "Someone check on @CHlLWELLS .", "1605397289664905216": "I mean let’s see if Pakistan reaches the semis you’ll say the same.Mike LUHG and his minions live a sad life to the extent to which they aren’t happy so they piss on others who are happy lol. Ironic coming from a bunch who hasn’t “won” anything personally", "1604991816272867330": "@AshwathRamesh7 Not possible as long as the human race continues to have autonomy over its senses and social media is ubiquitous.", "1604985673693696001": "@AshwathRamesh7 Dude, he has nothing to prove . It’s Finito. A world cup trounces every possible argument . That’s it. He’s in a league of his own. Comparing him to cr7 is a disrespect from now on and will only be done by cr7 fans. No sane neutral will entertain that convo anymore", "1604982790533308417": "@ChelseaFCW help a fellow cfc fan", "1604973917629599744": "Are these tools actually this thick? Pipe down and stick to some other sport. Your shouts not even worth a debate anymore lol. Come back after winning a World Cup", "1604972044092743680": "@CHlLWELLS The “pendu” fans are clutching at straws and massively converted to Mbappe Stan for the finals . Like their goat , their interim stan couldn’t one up the true goat. The fools in the mud😭", "1604954622753636353": "Anyone can whip out some geeky words, freeze frames of a game, circle stuff in it and sound like a tactico these days", "1604891451913285634": "@CHlLWELLS 😭😭😭. You have got secret admirers Lia", "1604767907313242112": "Someone check up on @lebfirecracker jajaja. Ça va?", "1604733775111651328": "😭", "1604681968821886976": "@CarefreeLewisG Rate this use of Google translate my guy😭", "1604601945393881088": "@cfcwevans Lol, I can’t believe they’re still talking😭", "1604591193857601536": "@TOSOTC_CFC The only Argentine we should be getting is Enzo", "1604560661455179776": "@WorldWideCheIs Let it go bruh", "1604545465844142080": "Where are the 🐐’s World Cup pics", "1604536277239746560": "And he’s crowned", "1604532706158968833": "@CHlLWELLS What happened", "1604522753809592323": "@CHlLWELLS Awww. Be carefu", "1604515941907582976": "We have to look into the the South American market a lot more", "1604512879524614144": "@FutbolCheIsea 130m release clause", "1604511555378630658": "@jestersvengence W Jesters as usual . 🐐 deserves his World Cup", "1604511304500514817": "@jestersvengence Who you rooting for ?", "1604511241187524609": "@jestersvengence Jesters’ wisdom for today", "1604509451796774913": "If we don’t go for Enzo, I won’t believe in this “youth project” that were tryna. Bun Bellingham, GO FOR ENZO and RICE", "1604509230870179841": "@bellacfc They say denial is stage 1 of processing grief", "1604508852711751680": "@CHlLWELLS Wouldn’t bother turning tbh", "1604508662374232065": "@TOSOTC_CFC Did you see Enzo at 6 Miz? A destroyer DM with him like Rice for ensuring midfield physicality (for the Prem) , and we’re gonna cook", "1604508349768564742": "@CHlLWELLS 😭", "1604502535309778945": "@Ahmed_UTC2 @CarefreeLewisG Lol ok😭", "1604501965647810560": "Break the bank for Enzo", "1604500927557533699": "@chelseayouth ?", "1604499474470277121": "@AbhishekCFCRB04 @TOSOTC_CFC Yeah go on. Cry lol", "1604499027827240961": "@AbhishekCFCRB04 @TOSOTC_CFC Softest foul? Are you even watching mate? He clipped from behind. You can Stan CR7 but please be sensible in doing so", "1604498851859419139": "@CarefreeLewisG So you saying that ain’t a pen lol", "1604497923672518657": "If anyone’s crying “tHe GaMe iS rIgGed”, block em. No point trying to convince", "1604492366148427777": "Miss your stream guys", "1604492333248311296": "I swear man . Where are the Chelsea content creators at ? No watchalong for the world cup finals . Damning @TOSOTC_CFC @matissearmani @CarefreelewisG2", "1604486532584603649": "@bellacfc Omg I swear ….", "1604408973410848768": "I’m not a England fan but you get an insight into most people’s mentality while reading through the comments and QTs. Baffling lol. Thank god he’s in charge", "1604358300413222913": "@RuLoCheeks @Lxmpard @Blue_Danny_ Loool. Just shows you have never watched him@and are just going by the casual hispter take out here but go on.", "1604326367977693185": "@RuLoCheeks @Blue_Danny_ Casemiro, Fabinho , Fernandinho, Thomas Partey. Tell me what’s common between all of those", "1604258736348233728": "@CHlLWELLS Awwwww", "1603132590965362691": "@CHlLWELLS I love how u keep adding flags 😭", "1603115263624454149": "@CHlLWELLS Game management is important now. Hope they equalise and we go to extra time", "1603107761277272065": "@CHlLWELLS Damn 😞", "1603098875660738562": "@CHlLWELLS That’s totally true. But if you were to choose Mbappe’s France or Morocco against Messi, who would you take? I believe Messi magic can split the Moroccan defense", "1603098005313306632": "@CHlLWELLS Same. Want to make the 🐐 bagging the World Cup as easier as possible", "1603097668548526083": "@CHlLWELLS Agreed. Who are you rooting for lia", "1603097510859489280": "@lebfirecracker @RATP Fairs", "1603097106759180289": "@lebfirecracker @RATP A q, if Lebanon and France were go to head to head , who would you root for haha?", "1603015155486425088": "@lebfirecracker Both irrelevant points imo. Potter is a young coach trying prove himself. TT is a world class manager in the game who was burnt out af. Let me remind you the cups he won and also turmoil he guided us through and made us play the way he did at bernabeu all while a personal issue", "1602950795296743424": "@lebfirecracker Hope everything is fine", "1602875054265872385": "@WorldWideCheIs There’s no way , CR7 is a better footballer than Messi. I’m sorry man", "1602874980257394688": "@WorldWideCheIs Messi has 2 different leagues. And it’s not like cr7 went to underdogs either (nor did Messi). But if you look at me and say CR7 is a better footballer than Messi, I’m sorry man. He might be your favourite player and you can certainly prefer him over Messi but", "1602743966436233217": "@mattjball98 Who would you go for as his replacement ?", "1602522166557392896": "WHY TF ARE LETTING THE SCOUSE LOT GET ENZO….. I swear Boehly", "1602424509704855554": "Is it just me or is it concerning to see so many twats in the comments saying “respect their culture”? Omg. Just brings out the archaic mindset in a lot of people", "1602160815871860736": "CR7 to the Bridge for Broja . Who says no 😭", "1602077396131250176": "@CHlLWELLS Agreed", "1602076987413200896": "@CHlLWELLS Boehly got that horrendously wrong. I hope it doesn’t make us an arsenal", "1602076880785608711": "@CHlLWELLS Agreed. Let’s see what potter does but he ain’t moving me so far. We got no pull in the market. If big signings were to come in, they gotta respect the manager. If they gotta respect , they must know him. Top players don’t know potter. Appointing a head coach before DoF is a mare", "1602076080050937859": "@CHlLWELLS Totally true. Although TT was burnt out af given the club situation and his personal life, I really thought he needed a break from football. If we had to sack TT , it should have been during the WC and bringing in Luis Enrique.", "1602075186576371715": "@CHlLWELLS This kinda appointment is totally against my ethos. “Attractive football”. Goddamn. Chelsea were never that. I’m sick that we appointed him to play attractive football.", "1602074998264455170": "@CHlLWELLS Totally true. This is why I’m really skeptical. Looking like we trying to be arsenal fgs. We have to try to emulate Real Madrid and never let the standards drop. Even though we have to go through a rough period , it would be better if it’s with a winner imo.", "1602074065317105671": "@CHlLWELLS Lol this is exactly my point.Them lot want to be politically correct and try to act like sensible and mature but what credit has Potter gotten in his bank to fall back on if he’s failing?Apart from some coaching experience, I don’t see how this is any diffenrt to appointing lamps", "1602073426700763136": "@CHlLWELLS W. Don’t let the “propa Chels” see this. Else they’ll be calling you a plastic", "1601688015617032194": "Giroud. One of the  best and underrated STs of our generation", "1601623518768402433": "@yeabatu_lij @bellacfc Shut up Nonce", "1601607617763495937": "@CHlLWELLS Cancelo ??I think a veteran like CR7 is needed . Especially since he’s Mr Clutch", "1601606643267272705": "@CHlLWELLS Would you want cr7 to come on?", "1601384606464630784": "@lebfirecracker ?", "1601379064421711873": "@CHlLWELLS What are they saying ?😭. I can’t see it", "1601340041556815873": "@angie_cfc Just shout Vamos Leo for the bants haha", "1601335627781316608": "🐐🇦🇷", "1601330516200148992": "@meggaherne I thought he was good today tbh", "1601287721137623040": "@Alexguazzelli Why ? Just why 😭", "1601165149192491008": "@lebfirecracker As entertaining as it has been  , mid season injuries have put a dampener on it", "1600980310975741952": "@ByloneMichael @bellacfc @AshwathRamesh7", "1600963068573671424": "Btw potter ain’t a pe coach. But I still would have preferred Enrique over him.", "1600962126691958784": "W", "1600962099710406656": "@bellacfc Why? He’s an awesome coach", "1600621851511820291": "@abigglover Please tell me you spat out your drink laughing 😭"}